// 给你两个按 非递减顺序 排列的整数数组 nums1 和 nums2，另有两个整数 m 和 n ，分别表示 nums1 和 nums2 中的元素数目。
//
// 请你 合并 nums2 到 nums1 中，使合并后的数组同样按 非递减顺序 排列。
//
// 注意：最终，合并后数组不应由函数返回，而是存储在数组 nums1 中。为了应对这种情况，nums1 的初始长度为 m + n，其中前 m 个元素表示应合并
// 的元素，后 n 个元素为 0 ，应忽略。nums2 的长度为 n 。
//
//
//
// 示例 1：
//
//
// 输入：nums1 = [1,2,3,0,0,0], m = 3, nums2 = [2,5,6], n = 3
// 输出：[1,2,2,3,5,6]
// 解释：需要合并 [1,2,3] 和 [2,5,6] 。
// 合并结果是 [1,2,2,3,5,6] ，其中斜体加粗标注的为 nums1 中的元素。
//
//
// 示例 2：
//
//
// 输入：nums1 = [1], m = 1, nums2 = [], n = 0
// 输出：[1]
// 解释：需要合并 [1] 和 [] 。
// 合并结果是 [1] 。
//
//
// 示例 3：
//
//
// 输入：nums1 = [0], m = 0, nums2 = [1], n = 1
// 输出：[1]
// 解释：需要合并的数组是 [] 和 [1] 。
// 合并结果是 [1] 。
// 注意，因为 m = 0 ，所以 nums1 中没有元素。nums1 中仅存的 0 仅仅是为了确保合并结果可以顺利存放到 nums1 中。
//
//
//
//
// 提示：
//
//
// nums1.length == m + n
// nums2.length == n
// 0 <= m, n <= 200
// 1 <= m + n <= 200
// -10⁹ <= nums1[i], nums2[j] <= 10⁹
//
//
//
//
// 进阶：你可以设计实现一个时间复杂度为 O(m + n) 的算法解决此问题吗？
// Related Topics 数组 双指针 排序 👍 1339 👎 0

package main

import "fmt"

func main() {
	result := merge([]int{1, 2, 3, 0, 0, 0}, 3, []int{2, 5, 6}, 3)
	fmt.Println(result)
}

// leetcode submit region begin(Prohibit modification and deletion)
func merge(nums1 []int, m int, nums2 []int, n int) {
	cur := m + n - 1
	for i, j := m-1, n-1; j >= 0; cur-- {
		if i == -1 || nums2[j] >= nums1[i] { // 大数组已遍历完，将小数组追加进去
			nums1[cur] = nums2[j]
			j--
		} else {
			nums1[cur] = nums1[i]
			i--
		}
	}
	// for i, j := m-1, n-1; i >= 0 || j >= 0; cur-- {
	// 	if i == -1 { // 大数组已经遍历完，后续追加小数组到前面
	// 		nums1[cur] = nums2[j]
	// 		j--
	// 	} else if j == -1 { // 当遍历完小数组后，直接返回大数组就可
	// 		break
	// 	} else if nums2[j] > nums1[i] {
	// 		nums1[cur] = nums2[j]
	// 		j--
	// 	} else {
	// 		nums1[cur] = nums1[i]
	// 		i--
	// 	}
	// }
}

// leetcode submit region end(Prohibit modification and deletion)

// 使用临时数组，依次遍历两个数组的值判断大小追加到临时数组中
func merge1(nums1 []int, m int, nums2 []int, n int) {
	tmp := make([]int, 0, m)
	for i, j := 0, 0; ; {
		if j == n {
			tmp = append(tmp, nums1[i:]...)
			break
		}
		if i == m {
			tmp = append(tmp, nums2[j:]...)
			break
		}
		if nums1[i] < nums2[j] {
			tmp = append(tmp, nums1[i])
			i++
		} else {
			tmp = append(tmp, nums2[j])
			j++
		}
	}
	copy(nums1, tmp)
}

/*
解题思路：
相对于合并两个链表，合并数组多了一种从大数组尾部开始遍历，这样免去额外申请数组
*/
